Revit 2027 API
StairsPathType.StartSymbolTypeId Property
 The start symbol type of stairs path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId StartSymbolTypeId { get; set; }
Public Property StartSymbolTypeId As ElementId
	Get
	Set
public:
property ElementId^ StartSymbolTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member StartSymbolTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The startSymbolTypeId is not a valid start symbol or arrowhead type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace